{
    "content": "**O S C A R C U M M I N G\r\nS O F T W A R E D E V E L O P E R**\r\n\r\n A passionate software developer who thrives off learning and collaboration.\r\n\r\nWebsite : oscarcumming.github.io/index.html\r\nGithub : github.com/Oscarcumming\r\nLinkedin : linkedin.com/in/oscarcumming\r\n\r\n \r\n\r\n---\r\n\r\n  **S K I L L S :**\r\n\r\n**BAE - British Aerospace: Digital Intelligence (NDA) - Current**\r\n\r\n\n\n\n- Worked within complex API systems that handles millions of messages to successfully deliver client\r\nrequested additions and features - Java, kafka, elasticsearch and postgreSQL.\r\n\n\n\n- Developed and improved front end features, even becoming a point of guidance on it - React, Typescript, Redux.\r\n\n\n\n- Trained new joiners to get them up to speed and alleviate team pressure on senior devs.\r\n\n\n\n- All code tested to ensure code base robustness and ease of maintenance. Upheld code quality and functionality by delivering bug fixes - Junit, Jest.\r\n\r\n **Outcome:** Continuously delivered new features and fixes to this massive project while collaberating with\r\nmultiple teams and developing quality code.\r\n\r\n \r\n\r\n---\r\n\r\n **Independent Contract Work – Animal Manager Ltd (NDA) - Paid**\r\n\r\n\n\n\n- Developed new homepage for the Animal Manager App to clients design using react native, css, kittenUI.\r\n\n\n\n- Database querying and application performance improved through pagination and caching of data. Caching handled by Apollo and pagination by GraphQL.\r\n\n\n\n- React-native, pagination and caching principles and logic self taught.\r\n\n**Outcome:** A successfully styled and branded calendar-style agenda feed that cached and paginated user\r\nitems and events\r\n\r\n \r\n\r\n---\r\n\r\n **Thesis Project – In collaboration with Animal Manager Ltd. – Distinction in Project**\r\n\r\n\n\n\n- Developed an application to be used by veterinarian when assessing the survival probability of sick\r\nhorses. See website and Github.\r\n\n\n\n- Using Kaggle Data, Panda, SciKit and Python, a machine learning model was built that outputs horse survival percentage.\r\n\r\n\r\n**N O T A B L E W O R K :**\r\n\n\n\n- British Aerospace : React, Typescript, Java, Maven, Springboot, Elasticsearch, Kafka, Kubernetes, Docker, PostgresQL, Junit, Jest, Version Control Software.\r\n\n\n\n-  Contract Work : React-Native, JavaScript, GraphQL, Apollo, CSS, Caching, Pagination, Expo, Version, Control Software\r\n\n\n\n- Previous : React, Java, Python, JavaScript, PHP, MySQL, Axios, Flask, PHP, CSS, Panda, Scikit, MachineLearning, Data Processing\r\n\r\n**E D U C A T I O N :**\r\n\n\n\n- MSc Software Development Queens University : Diploma with Commendation\r\n\n\n\n- MSc Architecture Ulster University\r\n\n\n\n- BA Hons Architecture Ulster University\"\r\n"
}